{
  "target_role": "Software Engineer",
  "summary": "Results-driven Computer Science student with a strong foundation in backend engineering, specializing in building scalable, secure, and high-performance RESTful APIs. Proficient in Python and experienced with FastAPI for backend service development. Demonstrated ability to implement complex business logic, design robust PostgreSQL database schemas, and enforce stringent security measures including Role-Based Access Control (RBAC) and JWT authentication. Possesses strong Data Structures & Algorithms fundamentals and algorithmic thinking for optimizing system design and performance. Eager to contribute to dynamic software development teams.",
  "skills": [
    {
      "category": "Languages",
      "items": "Python, Node.js, Java, Go, C"
    },
    {
      "category": "Frameworks & Libraries",
      "items": "FastAPI, Express.js"
    },
    {
      "category": "Databases",
      "items": "PostgreSQL, MongoDB, SQL"
    },
    {
      "category": "Developer Tools",
      "items": "Git & GitHub, Postman, Docker"
    },
    {
      "category": "Core Concepts",
      "items": "Data Structures & Algorithms, Object-Oriented Programming (OOP), RESTful API Design, Asynchronous Programming, API Performance Optimization, System Design, Role-Based Access Control"
    }
  ],
  "projects": [
    {
      "title": "Pantry Management API (Python & FastAPI)",
      "repo_link": null,
      "points": [
        "Reduced food waste by *20%* by engineering a high-performance backend with *Python* and *FastAPI* to track real-time inventory expiration.",
        "Developed and managed user data across *10+ scalable RESTful endpoints* by implementing efficient *CRUD* operations, adhering to API best practices.",
        "Implemented a scheduled query system in *PostgreSQL* to automate user alerts *3 days* before item expiry, demonstrating expertise in database management and complex business logic.",
        "Engineered a sophisticated logic engine to cross-reference available ingredients with *1000+ recipes*, generating personalized suggestions and showcasing strong algorithmic thinking."
      ]
    },
    {
      "title": "Tiered Access Content API (Node.js & Express.js)",
      "repo_link": "https://github.com/dharunm73/Subscription",
      "points": [
        "Engineered a scalable RESTful API with *Node.js* and *Express.js* to manage tiered content access across *15+ endpoints*, demonstrating proficiency in backend service development.",
        "Ensured *zero unauthorized access* through robust *Role-Based Access Control (RBAC)* and *JWT authentication*, fulfilling strict security requirements for user data.",
        "Designed and optimized a normalized *5-table PostgreSQL* schema, significantly improving query performance for complex user subscription data."
      ]
    },
    {
      "title": "Resume CI/CD Pipeline",
      "repo_link": null,
      "points": [
        "Engineered an automated CI/CD pipeline, reducing resume customization time by *98% (from 30 mins to 30 secs)*, demonstrating efficiency in process automation and integration with external APIs.",
        "Achieved *zero-cost document generation* by integrating *Typst* for programmatic PDF rendering, showcasing cost-optimization and tool selection skills.",
        "Optimized content relevance for ATS systems through advanced *prompt engineering* and JSON data parsing, demonstrating strong problem-solving and data manipulation abilities."
      ]
    }
  ],
  "awards": [
    {
      "title": "First Prize, TechTrivia",
      "date": "Apr 2025",
      "description": "Won 1st place in a college-level technical quiz covering *Data Structures and Algorithms* and core computer science concepts."
    },
    {
      "title": "First Prize, DashWiz (PowerBI)",
      "date": "Apr 2025",
      "description": "Created a dashboard optimizing logistics tracking, selected best among 50 teams for its analytical depth and problem-solving."
    },
    {
      "title": "First Prize, N8nate",
      "date": "Nov 2025",
      "description": "Architected an n8n workflow that automated certificate generation and emailing, demonstrating proficiency in workflow automation and integration."
    }
  ],
  "leadership": [
    {
      "role": "Content Team Member",
      "org": "ACE - Computer Science Department Club",
      "points": [
        "Authored detailed post-event reports to document key outcomes and metrics for departmental review, showcasing strong communication and analytical skills.",
        "Collaborated with the design team to create and distribute promotional materials and event invitations, contributing to event visibility and attendance.",
        "Actively participated in the event management lifecycle, from initial planning and logistics coordination to on-site execution and support, demonstrating strong teamwork and organizational abilities."
      ]
    }
  ]
}